app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2018-11-10 17:32:32.452158"], ["updated_at", "2018-11-10 17:32:32.452158"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2018-11-10 17:32:32.457496"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])